Repository: hirwacedric123/inzu_link
Catalog: locale/*/LC_MESSAGES/django.po
Languages: rw

source: Home
rw: Ahabanza

source: Dashboard
rw: Ikiganiro

source: Products
rw: Ibicuruzwa

source: My Listings
rw: Ibyanditswe byanjye

source: Create Listing
rw: Ongeramo ikintu

source: Inquiries
rw: Ibyifuzo

source: Chat
rw: Kuvugana

source: Settings
rw: Gucunga

source: Logout
rw: Sohoka

source: Login
rw: Injira

source: Register
rw: Kwiyandikisha

source: Change language
rw: Guhindura ururimi

source: InzuLink Logo
rw: Ikirango cya InzuLink

source: Welcome to InzuLink
rw: Murakaza neza kuri InzuLink

source: Real Estate & Furniture Marketplace
rw: Isoko ry'Amazu n'Ibikoresho

source: Browse Properties
rw: Reba Amazu

source: List Your Property
rw: Ongeramo Amazu yawe

source: Save Changes
rw: Bika Amahinduka

source: Cancel
rw: Kureka

source: Submit
rw: Ohereza

source: Search
rw: Shakisha

source: Filter
rw: Suzuma

source: Price
rw: Igiciro

source: Location
rw: Aho biherereye

source: Category
rw: Ubwoko

source: Description
rw: Ibisobanuro

source: Contact Seller
rw: Vugana n'Umucuruzi

source: Send Inquiry
rw: Ohereza Ikibazo

source: View Details
rw: Reba Ibisobanuro

source: No results found
rw: Ntacyo wabonye

source: Loading...
rw: Buri gushaka...

source: Error
rw: Ikosa

source: Success
rw: Byagenze neza

source: Please correct the errors below
rw: Nyamuneka koresha neza ibyanditse hepfo

source: This field is required
rw: Iki gisimbu ni ngombwa

source: Invalid input
rw: Ibyanditse ntabwo bikwiye

source: Profile
rw: Amakuru yanjye

source: Account
rw: Konti

source: Password
rw: Ijambobanga

source: Email
rw: Imeyili

source: Phone Number
rw: Nomero ya Telefoni

source: First Name
rw: Izina rya mbere

source: Last Name
rw: Izina rya nyuma

source: Username
rw: Izina ry'ukoresha

source: Messages
rw: Ubutumwa

source: Unread
rw: Ntibyasomwe

source: Send Message
rw: Ohereza Ubutumwa

source: Type a message...
rw: Andika ubutumwa...

source: Connected
rw: Wiyunze

source: Disconnected
rw: Wavuye

source: Connecting...
rw: Buri gushaka kuyunga...

source: View All Products
rw: Reba Ibicuruzwa Byose

source: Become a Vendor
rw: Kuba Umucuruzi

source: Create Your Account
rw: Kwandika Konti yawe

source: Add Your Product
rw: Ongeramo Ibicuruzwa byawe

source: History
rw: Amateka

source: Saved
rw: Byabitswe

source: Scan
rw: Gukurura

source: Stats
rw: Imibare
